/*
What is the Big O notation for Function findStudentById . Explain your reason.
Answer:O(n) เพราะการที่จะหาค่าที่เราต้องการ โดยเฉพาะในกรณีที่ค่าอยู่ในตำแหน่งสุดท้ายของ Array โปรแกรมต้องทำการตรวจสอบค่าของสมาชิกทุกตัวจนกระทั่งเจอค่าที่เราต้องการ


*/

/* 
What is the Big O notation for Function findProductPrice. Explain your reason.
Answer:O(log n) เพราะในการหาค่าที่เราต้องการแต่ละครั้งโปรแกรมจะเริ่มจากค่ากลาง หากยังไม่เจอค่าที่ต้องการโปรแกรมจะหั่นข้อมูลออกทีละครึ่ง และค้นหาในข้อมูลส่วนที่เหลือไปเรื่อยๆจนกว่าจะเจอค่าที่ต้องการ 
       โดยจำนวนการตรวจสอบค่าของสมาชิกจะมีจำนวนมากที่สุดที่ log n ครั้ง แต่มีข้อแม้ว่า algorithm นี้จะใช้ได้กับข้อมูลที่ถูกเรียงลำดับแล้วเท่านั้น

*/

/* 
Which function is more efficient and why?
Answer: จากโจทย์และข้อมูลที่กำหนดให้มีการเรียงลำดับข้อมูล เพราะฉะนั้นการค้นหาโดยใช้ binary search จึงมีประสิทธิภาพมากกว่า เพราะใช้จำนวนการดำเนินการตรวจสอบสมาชิกน้อยกว่า linear search


*/
